# Parameters
nc: 80  # number of classes
scales:
  # [depth, width, max_channels]
  s: [0.33, 0.50, 1024]
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64,3,2]]           # 0     
  - [ -1, 1, MetaNeXtStage, [ 32,64,2 ] ]  # 1
  - [ -1, 1, MetaNeXtStage, [ 64,128,2 ] ]  # 2
  - [ -1, 1, MetaNeXtStage, [ 128,256,2 ] ]  # 3
  - [ -1, 1, MetaNeXtStage, [ 256,512,2 ] ]  # 4
  - [-1, 1, MSPAM,  [1024, 5 ]]  # 5      
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 6 
  - [[-1, 3], 1, Concat, [1]]  # 7               
  - [-1, 2, A2C2f, [512, False, -1]]  # 8          
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 9 
  - [[-1, 2], 1, Concat, [1]]  # 10             
  - [-1, 2, A2C2f, [256, False, -1]] # 11      
  - [-1, 1, Conv, [256, 3, 2]] # 12          
  - [[-1, 8], 1, Concat, [1]]  # 13            
  - [-1, 2, A2C2f, [512, False, -1]] # 14          
  - [-1, 1, Conv, [512, 3, 2]] # 15              
  - [[-1, 5], 1, Concat, [1]]  # 16               
  - [-1, 2, C3k2, [1024, True]] # 17               
  - [[11, 14, 17], 1, Detect, [nc]]  #             

